<?php
header('Content-Type:text/html;charset=utf-8');
/* 1. 字符串函数库查手册看代码
 * 2.嵌套循环：
 *   (1)行列图形(两种方法实现)
 *     *****
 *     ****
 *     ***
 *     **
 *     * 
 *   (2) 输出  E和 Z 图形
 *   (3) 外循环轮次
 *     a.判断具体一个变量 $var=3753是否包含7
 *       判断范围 10-999 中包含 7的值
 *     b.判断具体一个变量 $var =11 是否是素数
 *       素数(质数): 只能被1和本身整数的数
 *       分析：11%(2~10) 如果分别除2~10的数余数
 *            都不是0那是素数
 *            33%(2~32)
 *            17%(2~16)
 *     
 *       判断范围2-100中 的素数
 *     
 *     
 *     
 *     
 *     
 *     
 *   
 * 
 * 
 */